<a href="https://colab.research.google.com/github/sigvehaug/Introduction-to-Python-for-Medical-Researchers/blob/master/04-Exercise-1-Sol.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Introduction to Python Programming for Medical Researchers, University of Bern, Sigve Haug

# Exercise 1 - (30 min)

**Task:** What is the the repsective average blood pressure of men over 70 and below 70 in the dataset provided in the example notebook?

**Steps (copy and paste from the example)**

- Read the dataset into a dataframe
- Clean the dataset
- Make a dataset containing only men over 70
- Make a dataset containing only men below 70
- Retrieve the means

If you have time, do more things!

---

In [ ]:
import pandas as pd
url  = 'https://drive.google.com/uc?export=download&id=1d8x5ZSwa9Yn-8J8NxiygFDaoMO8PRNWc'
data = pd.read_csv(url)

In [ ]:
pd.set_option('max_rows', None)

In [ ]:
# Removing all rows without good blood pressure values
clean_data = data.drop(data[data['BP_SYS']=='#NULL!'].index)
clean_data = data.drop(data[data['BP_DIA']=='#NULL!'].index)

In [ ]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 71 entries, 1 to 99
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     71 non-null     float64
 1   Sex     71 non-null     int64
 2   BP_SYS  71 non-null     object
 3   BP_DIA  71 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 5.3+ KB

In [ ]:
clean_data['BP_SYS'] = pd.to_numeric(clean_data['BP_SYS'])
clean_data['BP_DIA'] = pd.to_numeric(clean_data['BP_DIA'])

In [ ]:
male_df = clean_data[clean_data['Sex']==1]
male_df_old = male_df[male_df['Age']>=70.0] 
male_df_old.head()
male_df_young = male_df[male_df['Age']<70.0]
male_df_young

      Age  Sex  BP_SYS  BP_DIA
9   68.64    1     150      80
22  49.19    1     160     105
26  65.62    1     105      70
29  22.08    1     126      70
42  55.48    1     161      56
44  49.14    1     143      86
52  66.71    1     127      60
60  50.99    1     166      98
67  43.86    1     145      75
70  48.87    1      90      50
83  69.19    1     131      90
88  65.13    1     158      89

In [ ]:
clean_data = data.replace('#NULL!',float(0))
clean_data['BP_SYS'] = pd.to_numeric(clean_data['BP_SYS'])
clean_data['BP_DIA'] = pd.to_numeric(clean_data['BP_DIA'])
clean_data['BP_SYS'] = clean_data['BP_SYS'].replace(float(0),clean_data['BP_SYS'].mean())
clean_data['BP_DIA'] = clean_data['BP_DIA'].replace(float(0),clean_data['BP_DIA'].mean())
clean_data

       Age  Sex  BP_SYS  BP_DIA
0    87.76    0  103.42   60.00
1    76.22    0  150.00   77.00
2    70.28    0  115.00   72.00
3   100.28    1  183.00   82.00
4    61.62    0  103.42   57.53
..     ...  ...     ...     ...
95   93.16    1  103.42   57.53
96   62.69    0  133.00   72.00
97   79.45    1  200.00   70.00
98   86.94    1  149.00   54.00
99   81.09    1  175.00   88.00

[100 rows x 4 columns]

In [ ]:
male_df = clean_data[clean_data['Sex']==1]
male_df_old = male_df[male_df['Age']>=70.0] 
male_df_old.head()
male_df_young = male_df[male_df['Age']<70.0]
male_df_young

      Age  Sex  BP_SYS  BP_DIA
9   68.64    1  150.00   80.00
15  65.65    1  103.42   57.53
22  49.19    1  160.00  105.00
26  65.62    1  105.00   70.00
29  22.08    1  126.00   70.00
41  64.89    1  103.42   57.53
42  55.48    1  161.00   56.00
44  49.14    1  143.00   86.00
52  66.71    1  127.00   60.00
60  50.99    1  166.00   98.00
67  43.86    1  145.00   75.00
70  48.87    1   90.00   50.00
76  69.66    1  103.42   57.53
83  69.19    1  131.00   90.00
88  65.13    1  158.00   89.00

In [ ]:
male_df_young.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15 entries, 9 to 88
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     15 non-null     float64
 1   Sex     15 non-null     int64
 2   BP_SYS  15 non-null     float64
 3   BP_DIA  15 non-null     float64
dtypes: float64(3), int64(1)
memory usage: 600.0 bytes

In [ ]:
male_df_young.mean()

Age        54.575000
Sex         1.000000
BP_SYS    138.500000
BP_DIA     77.416667
dtype: float64

---

Now we will continue with a second example tutorial illustrating how medical researchers can use Python to work with images. The notebook is [here](https://github.com/sigvehaug/Introduction-to-Python-Programming-For-Medical-Researchers/blob/master/5-Example-2-Medical_Analysis.ipynb).